// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
// A (3,6); B (2,1) -> 5,10
// A (7,-5); B (1,-1) -> 7,21

int a = 3;
int b = 2;
double res = Math.Pow(a , b);
res = Math.Sqrt(res -1);
Console.WriteLine(res);
